Revit 2027 API
BuiltInFailures.EditingFailures.HaveNoPermissionToEdit Property
 You do not have permission to edit the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HaveNoPermissionToEdit { get; }
Public Shared ReadOnly Property HaveNoPermissionToEdit As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HaveNoPermissionToEdit {
	FailureDefinitionId^ get ();
}
static member HaveNoPermissionToEdit : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace